In [1]:
import pandas as pd
df=pd.read_csv('C:\\Users\\ANISH M S\\Downloads\\titanic (1).csv')

In [2]:
df

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",2,male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.0,0,0,112053,30.0000,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.0,0,0,111369,30.0000,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.0,0,0,370376,7.7500,NaN,Q,0

In [3]:
df.drop(['PassengerId','SibSp','Parch','Cabin','Embarked','Name'],axis=1,inplace=True)

In [4]:
target=df.Survived
inputs=df.drop(['Survived'],axis=1)

In [5]:
inputs

     Pclass     Sex   Age            Ticket     Fare
0         3    male  22.0         A/5 21171   7.2500
1         1  female  38.0          PC 17599  71.2833
2         3  female  26.0  STON/O2. 3101282   7.9250
3         1  female  35.0            113803  53.1000
4         3    male  35.0            373450   8.0500
..      ...     ...   ...               ...      ...
886       2    male  27.0            211536  13.0000
887       1  female  19.0            112053  30.0000
888       3  female   NaN        W./C. 6607  23.4500
889       1    male  26.0            111369  30.0000
890       3    male  32.0            370376   7.7500

[891 rows x 5 columns]

In [6]:
dummies=pd.get_dummies(inputs['Sex'])
dummies

     female   male
0     False   True
1      True  False
2      True  False
3      True  False
4     False   True
..      ...    ...
886   False   True
887    True  False
888    True  False
889   False   True
890   False   True

[891 rows x 2 columns]

In [7]:
inputs=pd.concat([inputs,dummies],axis=1)

In [8]:
inputs

     Pclass     Sex   Age            Ticket     Fare  female   male
0         3    male  22.0         A/5 21171   7.2500   False   True
1         1  female  38.0          PC 17599  71.2833    True  False
2         3  female  26.0  STON/O2. 3101282   7.9250    True  False
3         1  female  35.0            113803  53.1000    True  False
4         3    male  35.0            373450   8.0500   False   True
..      ...     ...   ...               ...      ...     ...    ...
886       2    male  27.0            211536  13.0000   False   True
887       1  female  19.0            112053  30.0000    True  False
888       3  female   NaN        W./C. 6607  23.4500    True  False
889       1    male  26.0            111369  30.0000   False   True
890       3    male  32.0            370376   7.7500   False   True

[891 rows x 7 columns]

In [9]:
inputs.drop(['Sex'],axis=1,inplace=True)

In [10]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [11]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [12]:
med=inputs.Age.mean()
med

29.69911764705882

In [13]:
inputs.Age.fillna(med,inplace=True)

In [14]:
inputs.Age[:10]

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [15]:
inputs.drop(['Ticket'],axis=1,inplace=True)

In [27]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(inputs,target,test_size=0.3)

In [17]:
len(x_test)

268

In [18]:
len(x_train)

623

In [19]:
x_train

     Pclass        Age     Fare  female   male
447       1  34.000000  26.5500   False   True
467       1  56.000000  26.5500   False   True
159       3  29.699118  69.5500   False   True
72        2  21.000000  73.5000   False   True
706       2  45.000000  13.5000    True  False
..      ...        ...      ...     ...    ...
229       3  29.699118  25.4667    True  False
695       2  52.000000  13.5000   False   True
736       3  48.000000  34.3750    True  False
556       1  48.000000  39.6000    True  False
80        3  22.000000   9.0000   False   True

[623 rows x 5 columns]

In [20]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [28]:
model.fit(x_train,y_train)

GaussianNB()

In [23]:
model.predict(x_test[:10])

array([1, 1, 0, 1, 0, 0, 1, 1, 0, 0], dtype=int64)

In [25]:
y_test[:10]

700    1
2      1
456    0
31     1
196    0
433    0
503    0
710    1
872    0
703    0
Name: Survived, dtype: int64

In [29]:
model.score(x_test,y_test)

0.7985074626865671

In [33]:
model.predict_proba(x_test[:10])

array([[1.93742512e-10, 1.00000000e+00],
       [9.09627337e-01, 9.03726629e-02],
       [1.35462295e-02, 9.86453770e-01],
       [9.69804904e-01, 3.01950957e-02],
       [4.88040586e-02, 9.51195941e-01],
       [5.06648146e-02, 9.49335185e-01],
       [8.52701721e-01, 1.47298279e-01],
       [4.66909008e-02, 9.53309099e-01],
       [9.61150288e-01, 3.88497116e-02],
       [9.86045162e-01, 1.39548381e-02]])